cf_billing/InformationRegisters/бестСтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСтавкиНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДССсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДСВнутри</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестСтавкиНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Получает ставку НДС
//
// Параметры:
//  Период		 - Дата 						- Период 
//  Организация	 - СправочникСсылка.Организации	- Организация
// 
// Возвращаемое значение:
//   - Число - ставка НДС для организации
//   - Неопределено - если ставка не найдена
//
Функция ПолучитьСтавкуНДС(Период, Организация) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бестСтавкиНДССрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.бестСтавкиНДС.СрезПоследних(&Период, Организация = &Организация) КАК бестСтавкиНДССрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СтавкаНДС;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

// Функция - Получаем сумму НДС
//
// Параметры:
//  Дата		 - Дата 						- Период 
//  Организация	 - СправочникСсылка.Организации	- Организация 
//  Сумма		 - Число	 					- Сумма
// 
// Возвращаемое значение:
//   - Число
//
Функция ПолучитьСуммуНДС(Дата, Организация,  Сумма) Экспорт
	Ставка = ПолучитьСтавкуНДС(Дата, Организация);
	Если Ставка = Неопределено Тогда
		Возврат 0;
	Иначе
		Возврат Сумма - Сумма / (Ставка / 100 + 1);
	КонецЕсли;
КонецФункции

#Область РеализацияИнтерефейса_

// Процедура - Заполняет схему запроса, для получения данных из РС "Ставки НДС"
//
// Параметры:
//  Схема				 - СхемаЗапроса	- СхемаЗапроса
//  ПараметрыОтбора		 - Структура	- Параметры отбора
//  ТаблицаДляПомещения	 - Строка	 	- Название временной таблицы
//
Процедура СтавкаНДСОрганизации(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "СтавкаНДСОрганизации") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];		
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтавкаНДСОрганизации());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	                              	
	ПараметрПериод 						= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
				
	ВспомогательныеПоля 				= "Период";
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 				= "Организация";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 			= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 					= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаСтавкаНДСОрганизации()
	
	Текст =
	"ВЫБРАТЬ
	|	бестСтавкиНДССрезПоследних.Организация КАК Организация,
	|	бестСтавкиНДССрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	бестСтавкиНДССрезПоследних.СтавкаНДССсылка КАК СтавкаНДССсылка,
	|	бестСтавкиНДССрезПоследних.СтавкаНДСВнутри КАК СтавкаНДСВнутри
	|ИЗ
	|	РегистрСведений.бестСтавкиНДС.СрезПоследних КАК бестСтавкиНДССрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти 

#КонецЕсли
